In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    {
        "a": [4,5,6],
        "b": [7,8,9],
        "c": [10,11,12]
    },
    index=[1,2,3]
)

df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

In [6]:
df = pd.DataFrame( {
    "Name": ["piyush", "shanku", "nikhil"],
    "Age": [21,20,25],
    "Location": ["Mumbai", "Pune", "Nagpur"]
    
},
    index=[1,2,3]
)

In [7]:
df

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur

In [8]:
df.head()

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur

In [9]:
df.tail()

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur

In [10]:
df.shape

(3, 3)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 72.0+ bytes

In [12]:
df.describe()

             Age
count   3.000000
mean   22.000000
std     2.645751
min    20.000000
25%    20.500000
50%    21.000000
75%    23.000000
max    25.000000

In [13]:
df['Age'].max()

np.int64(25)

In [14]:
df['Age'].min()

np.int64(20)

In [15]:
df['Age'].mean()

np.float64(22.0)

In [16]:
df.drop_duplicates()

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur

In [17]:
df = pd.DataFrame( {
    "Name": ["piyush", "shanku", "nikhil", "jony"],
    "Age": [21,20,25,35],
    "Location": ["Mumbai", "Pune", "Nagpur","America"]
    
},
    index=[1,2,3,4]
)

In [18]:
df

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur
4    jony   35  America

In [19]:
df.drop_duplicates()

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur
4    jony   35  America

In [20]:
df.loc[2]

Name        shanku
Age             20
Location      Pune
Name: 2, dtype: object

In [21]:
df.iloc[0:]

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
3  nikhil   25   Nagpur
4    jony   35  America

In [22]:
df.drop(3)

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune
4    jony   35  America

In [23]:
df[df.Age<25]

     Name  Age Location
1  piyush   21   Mumbai
2  shanku   20     Pune

In [25]:
df.isnull()

    Name    Age  Location
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False